{"title":"about me","date":"2019-10-31T16:32:58.000Z","updated":"2019-10-31T16:36:41.189Z","content":"<h1 id=\"Self-Introduction\">Self Introduction<a href=\"about#Self-Introduction\"></a></h1><h3 id=\"Edited-by-Ecin520\">Edited by Ecin520<a href=\"about#Edited-by-Ecin520\"></a></h3><p><strong>My name is Guo Wei, I like to play basketball, I like to listen to electronic music, I like to play guitar, I like to cook myself, but I have a unique love for programming. I like to play computer since I was young, but I have always been tossing myself. I have no enlightenment, but I have always been familiar with computers. Since my computer has not been connected to the Internet, I have not learned anything during the previous period. It wasn’t until I went to college that I started to really touch programming. I like to learn a lot of things myself and toss up some messy things. A year ago, when I was still learning algorithms, I first touched the language of java because of one. The BigInteger class, which uses a few lines of code to write in hundreds of lines of code in C language. Because of this competition, I took the first place in the whole hospital, so I started to have an interest in java. From that time on, I taught myself myself. I started to learn the most basic grammar types, etc., and later I did a final assignment for self-study swing and awt in order to finish the final assignment, and got the highest score. This has strengthened my pace of learning java. Later, I started to learn java springboot framework, and used springboot springmvc mybatis to do a final job, and once again got the highest score of the whole class. Since then, I have developed a strong interest in website development, self-study jsp servlet spring spring mvc mybatis redis Mysql Linux deployment operation and maintenance, etc., on the road to learning java, I will always work hard and improve myself. Come on!</strong></p>\n<p><img src=\"https://img-blog.csdnimg.cn/20190922175000168.png\" alt=\"img\" class=\"article-img\"></p>\n","link":"about","plink":"http://yoursite.com/about/","toc":[{"title":"Self Introduction","id":"Self-Introduction","index":"1"}]}